import {Post} from '../entities/Post';

export const posts: Array<Post> = [
  {
    author: {
      name: 'Dmytro Ivanov',
      photoUrl: 'https://www.wmj.ru/thumb/0x1502/filters:quality(75):no_upscale()/imgs/2017/11/08/13/1145577/02f490db91711eb4e7ef37ecedd7e2e9cb02dea6.jpg'
    },
    time: '9:46',
    likes: 439,
    comments: 34,
    photoUrl: 'https://img2.abo.media/upload/article/o_1dseoqs5h1ejj1ajciph19sqrdt41.jpg',
    description:'Старовинні вузькі вулички, маленькі затишні кафе, бруківка і будинки, які не втратили свій первозданний вигляд - так можна описати старий Львів. Ця частина міста по праву вважається місцем, де гості пізнають культуру і традиції Західної України. Засноване у 1256 році, старе місто переносить туристів у часи Австро-Угорської імперії. Неможливо залишитися байдужим до цієї частини міста. Прогулюючись вулицями Вірменська (на якій стоїть також Вірменська церква і Національний Музей), Краківська, Лесі Українки та Друкарська ви поринете в атмосферу старої Європи.'
  },
  {
    author: {
      name: 'Petro Shevchenko',
      photoUrl: 'https://rvcouch.ru/wp-content/uploads/2019/08/aa4c387004c44ad421ccc4cf728493bb-300x300.jpg'
    },
    time: '8:15',
    likes: 439,
    comments: 34,
    photoUrl: 'https://peterburg2.ru/uploads/20/03/04/ga11_hu65f.JPG',
    description:'Старовинні вузькі вулички, маленькі затишні кафе, бруківка і будинки, які не втратили свій первозданний вигляд - так можна описати старий Львів. Ця частина міста по праву вважається місцем, де гості пізнають культуру і традиції Західної України. Засноване у 1256 році, старе місто переносить туристів у часи Австро-Угорської імперії. Неможливо залишитися байдужим до цієї частини міста. Прогулюючись вулицями Вірменська (на якій стоїть також Вірменська церква і Національний Музей), Краківська, Лесі Українки та Друкарська ви поринете в атмосферу старої Європи.'
  }
];